0/hot/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0/hot";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0.0 0.0 0.02);
boundaryField
{
	exchanger
	{
		type	noSlip;
	}
	hot_inlet
	{
		type	surfaceNormalFixedValue;
		refValue	uniform -0.02;
	}
	hot_outlet
	{
		type	pressureInletOutletVelocity;
		value	uniform (0.0 0.0 0.02);
	}
	pipes
	{
		type	noSlip;
	}
  inlet_baffle
	{
		type	noSlip;
	}
	outlet_baffle
	{
		type	noSlip;
	}
}
