0/hot/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/hot";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000.0;
boundaryField
{
	exchanger
	{
		type	calculated;
		value	uniform 100000.0;
	}
	hot_inlet
	{
		type	calculated;
		value	uniform 100000.0;
	}
	hot_outlet
	{
		type	calculated;
		value	uniform 100000.0;
	}
	pipes
	{
		type	calculated;
		value	uniform 100000.0;
	}
	inlet_baffle
	{
		type	calculated;
		value	uniform 100000.0;
	}
	outlet_baffle
	{
		type	calculated;
		value	uniform 100000.0;
	}
}
