0/hot/p_rgh
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/hot";
	object	p_rgh;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000.0;
boundaryField
{
	exchanger
	{
		type	fixedFluxPressure;
	}
	hot_inlet
	{
		type	fixedFluxPressure;
	}
	hot_outlet
	{
		type	totalPressure;
		p0	uniform 100000.0;
		rho	rho;
		gamma	1.124;
	}
	pipes
	{
		type	fixedFluxPressure;
	}
	inlet_baffle
	{
		type	fixedFluxPressure;
	}
	outlet_baffle
	{
		type	fixedFluxPressure;
	}
}
