constant/cold/boundaryRadiationProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/cold";
	object	boundaryRadiationProperties;
}
baffles
{
}
baffles_slave
{
}
exchanger
{
}
exchanger_cold_inlet
{
}
exchanger_cold_outlet
{
}
pipes
{
}
pipes_inlet_baffle
{
}
pipes_outlet_baffle
{
}
