constant/cold/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    baffles
    {
        type            wall;
        inGroups        1(wall);
        nFaces          47187;
        startFace       18791459;
    }
    baffles_slave
    {
        type            wall;
        inGroups        1(wall);
        nFaces          47187;
        startFace       18838646;
    }
    cold_inlet
    {
        type            patch;
        nFaces          606;
        startFace       18885833;
    }
    cold_outlet
    {
        type            patch;
        nFaces          650;
        startFace       18886439;
    }
    exchanger
    {
        type            wall;
        inGroups        1(wall);
        nFaces          350804;
        startFace       18887089;
    }
    inlet_baffle
    {
          type	mappedWall;
          sampleRegion	hot;
          samplePatch	inlet_baffle;
          sampleMode	nearestPatchFace;
          offsetMode	uniform;
          offset	(0.0 0.0 0.0);
        nFaces          10669;
        startFace       19237893;
    }
    outlet_baffle
    {
         type	mappedWall;
         sampleRegion	hot;
         samplePatch	outlet_baffle;
         sampleMode	nearestPatchFace;
         offsetMode	uniform;
         offset	(0.0 0.0 0.0);
        nFaces          9933;
        startFace       19248562;
    }
    pipes
    {
      type	mappedWall;
      sampleRegion	hot;
      samplePatch	pipes;
      sampleMode	nearestPatchFace;
      offsetMode	uniform;
      offset	(0.0 0.0 0.0);
        nFaces          694425;
        startFace       19258495;
    }
)

// ************************************************************************* //
