constant/cold/viewFactorsDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/cold";
	object	viewFactorsDict;
}
writeViewFactorMatrix	true;
writeFacesAgglomeration	true;
writePatchViewFactors	false;
maxDynListLength	1000000;
facesPerCluster	5;
baffles
{
	nFacesInCoarsestLevel	374;
	featureAngle	20.0;
}
baffles_slave
{
	nFacesInCoarsestLevel	374;
	featureAngle	20.0;
}
exchanger
{
	nFacesInCoarsestLevel	2412;
	featureAngle	20.0;
}
exchanger_cold_inlet
{
	nFacesInCoarsestLevel	35;
	featureAngle	20.0;
}
exchanger_cold_outlet
{
	nFacesInCoarsestLevel	35;
	featureAngle	20.0;
}
pipes
{
	nFacesInCoarsestLevel	4083;
	featureAngle	20.0;
}
pipes_inlet_baffle
{
	nFacesInCoarsestLevel	239;
	featureAngle	20.0;
}
pipes_outlet_baffle
{
	nFacesInCoarsestLevel	239;
	featureAngle	20.0;
}
