system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: /home/gagan/Documents/heat_exhanger_another_atempt.blend
// Export date: 2022-07-16 21:12:19.494403

scale 1;

vertices
(
    ( -3.3 -0.5 -0.9 )
    ( 3.4 -0.5 -0.9 )
    ( 3.4 0.5 -0.9 )
    ( -3.3 0.5 -0.9 )
    ( -3.3 -0.5 1 )
    ( 3.4 -0.5 1 ) 
    ( 3.4 0.5 1 ) 
    ( -3.3 0.5 1 ) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (67 10 19) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
