system/hot/changeDictionaryDict
FoamFile
{
	version	2.0;
	format	binary;
	class	dictionary;
	location	"system/hot";
	object	changeDictionaryDict;
}
p_rgh
{
	boundaryField
	{
		exchanger
		{
			type	fixedFluxPressure;
		}
		exchanger_hot_inlet
		{
			type	fixedFluxPressure;
		}
		exchanger_hot_outlet
		{
			type	totalPressure;
			p0	uniform 100000.0;
			rho	rho;
			gamma	1.124;
		}
		pipes
		{
			type	fixedFluxPressure;
		}
		pipes_inlet_baffle
		{
			type	fixedFluxPressure;
		}
		pipes_outlet_baffle
		{
			type	fixedFluxPressure;
		}
	}
}
p
{
	boundaryField
	{
	}
}
U
{
	boundaryField
	{
		exchanger
		{
			type	noSlip;
		}
		exchanger_hot_inlet
		{
			type	surfaceNormalFixedValue;
			refValue	uniform -0.02;
		}
		exchanger_hot_outlet
		{
			type	pressureInletOutletVelocity;
			value	uniform (0.0 0.0 0.02);
		}
		pipes
		{
			type	noSlip;
		}
		pipes_inlet_baffle
		{
			type	noSlip;
		}
		pipes_outlet_baffle
		{
			type	noSlip;
		}
	}
}
T
{
	boundaryField
	{
		exchanger
		{
			type	zeroGradient;
		}
		exchanger_hot_inlet
		{
			type	totalTemperature;
			T0	uniform 383.0;
			gamma	1.124;
		}
		exchanger_hot_outlet
		{
			type	zeroGradient;
		}
		pipes
		{
			type	compressible::turbulentTemperatureCoupledBaffleMixed;
			value	uniform 383.0;
			kappaMethod	fluidThermo;
			kappa	none;
			neighbourFieldName	T;
			Tnbr	T;
			thicknessLayers	(0.005);
			kappaLayers	(385.0);
		}
		pipes_inlet_baffle
		{
			type	compressible::turbulentTemperatureCoupledBaffleMixed;
			value	uniform 383.0;
			kappaMethod	fluidThermo;
			kappa	none;
			neighbourFieldName	T;
			Tnbr	T;
			thicknessLayers	(0.005);
			kappaLayers	(385.0);
		}
		pipes_outlet_baffle
		{
			type	compressible::turbulentTemperatureRadCoupledMixed;
			value	uniform 383.0;
			qrNbr	none;
			qr	none;
			neighbourFieldName	T;
			kappaMethod	fluidThermo;
			kappa	none;
			Tnbr	T;
			thicknessLayers	(0.005);
			kappaLayers	(385.0);
		}
	}
}
