system/hot/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system/hot";
	object	fvOptions;
}
