system/surfaceFeatureExtractDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeaturesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: /home/gagan/Documents/heat_exhanger_another_atempt.blend
// Export date: 2022-07-16 21:12:19.494323


baffles.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

cold_inlet.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

cold_outlet.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

exchanger.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

hot_inlet.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

hot_outlet.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

inlet_baffle.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

outlet_baffle.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}

pipes.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 120; }

}
